In [2]:
import pandas as pd

In [3]:
import numpy as np

In [9]:
data = {'Nome': ['Lucas', 'Rafael', 'Laís'],
        'Idade': [29, 33, 11],
        'Cidade': ['Salvador', 'Rio de Janeiro', 'São Paulo']
       }
df = pd.DataFrame(data, index = range(1, 4))

In [10]:
df

     Nome  Idade          Cidade
1   Lucas     29        Salvador
2  Rafael     33  Rio de Janeiro
3    Laís     11       São Paulo

In [11]:
df.index

RangeIndex(start=1, stop=4, step=1)

In [12]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [13]:
df.index = ['a', 'b', 'c']

In [14]:
df

     Nome  Idade          Cidade
a   Lucas     29        Salvador
b  Rafael     33  Rio de Janeiro
c    Laís     11       São Paulo

In [15]:
df.columns

Index(['Nome', 'Idade', 'Cidade'], dtype='object')

In [16]:
type(df.columns)

pandas.core.indexes.base.Index

In [18]:
df.columns.to_list()

['Nome', 'Idade', 'Cidade']

In [19]:
df.columns.values

array(['Nome', 'Idade', 'Cidade'], dtype=object)

In [20]:
df

     Nome  Idade          Cidade
a   Lucas     29        Salvador
b  Rafael     33  Rio de Janeiro
c    Laís     11       São Paulo

In [21]:
df['Nome']

a     Lucas
b    Rafael
c      Laís
Name: Nome, dtype: object

In [22]:
type(df['Nome'])

pandas.core.series.Series

In [23]:
df['Estado'] = ['BA', 'RJ', 'SP']

In [24]:
df

     Nome  Idade          Cidade Estado
a   Lucas     29        Salvador     BA
b  Rafael     33  Rio de Janeiro     RJ
c    Laís     11       São Paulo     SP

In [25]:
#loc

In [26]:
#df.loc[linha,coluna]

In [27]:
df.loc['a',:]

Nome         Lucas
Idade           29
Cidade    Salvador
Estado          BA
Name: a, dtype: object

In [28]:
df.loc['a','Nome']

'Lucas'

In [29]:
df.loc['a','Idade':]

Idade           29
Cidade    Salvador
Estado          BA
Name: a, dtype: object

In [30]:
df.loc['b':'c',]

     Nome  Idade          Cidade Estado
b  Rafael     33  Rio de Janeiro     RJ
c    Laís     11       São Paulo     SP

In [31]:
df.loc[['a','c'], ['Idade','Estado']]

   Idade Estado
a     29     BA
c     11     SP

In [32]:
df

     Nome  Idade          Cidade Estado
a   Lucas     29        Salvador     BA
b  Rafael     33  Rio de Janeiro     RJ
c    Laís     11       São Paulo     SP

In [33]:
df.iloc[0, :]

Nome         Lucas
Idade           29
Cidade    Salvador
Estado          BA
Name: a, dtype: object

In [34]:
df.iloc[1:,2:]

           Cidade Estado
b  Rio de Janeiro     RJ
c       São Paulo     SP

In [36]:
df.iloc[:2,:3]

     Nome  Idade          Cidade
a   Lucas     29        Salvador
b  Rafael     33  Rio de Janeiro

In [37]:
df.iloc[[0, 2], [0, 3]]

    Nome Estado
a  Lucas     BA
c   Laís     SP

In [38]:
df

     Nome  Idade          Cidade Estado
a   Lucas     29        Salvador     BA
b  Rafael     33  Rio de Janeiro     RJ
c    Laís     11       São Paulo     SP

In [39]:
df['Idade'].mean()

24.333333333333332

In [40]:
df['Idade'].var()

137.33333333333331

In [41]:
df['Idade'].std()

11.71893055416463

In [42]:
df['Idade'].describe()

count     3.000000
mean     24.333333
std      11.718931
min      11.000000
25%      20.000000
50%      29.000000
75%      31.000000
max      33.000000
Name: Idade, dtype: float64